PW_Template/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 300;
        //type            zeroGradient;
    }

    outlet
    {
        //type            zeroGradient;
        // type            fixedValue;
        // value           uniform 287;
		type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    gasjet
    {
        type            zeroGradient;
        // type            fixedValue;
        // value           uniform 287;
    }
	
	back
    {
        type            empty;
    }
	
    front
    {
        type            empty;
    }

}

// ************************************************************************* //
