PW_Template/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:   2.3.0  ///4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    gasjet
    {
        type            kqRWallFunction;
        value           uniform 1;  //an inital guess
    }
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.0284; //calculated from Re using inlet diameter
        // intensity       184;
        value           uniform 184;  //placeholder calculated based on Re and U
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
	
	back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
	
    // open
    // {
    //     type            zeroGradient;
    // }
}


// ************************************************************************* //