PW_Template/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100;

boundaryField
{
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    gasjet
    {
        type            zeroGradient;
    }
    inlet
    {
        type            uniformTotalPressure;
        rho             none;
        psi             thermo:psi;
        gamma           1.4;
        p0              table
(
(0 100)
(1e-008 1000)
(20e-008 2000)
(40e-008 3000)
(60e-008 4000)
(80e-008 5000)
(1e-006 1.379e+006) 	// 13.79 bar, 200 psi
(3e-003 1.379e+006) 	// 13.79 bar, 200 psi
)
;

        value           uniform 100;
    }
    outlet
    {
       	type		waveTransmissive;
		field		p;
		psi			thermo:psi;
		gamma		1.4;
		fieldInf	1;//1e-6;//100;//
		lInf		0.5;
		value		uniform 1;//1e-6;//100;//
    }
}


// ************************************************************************* //
