PW_Template/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme      Kurganov;

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    //default         cellLimited Gauss linear 1.0;
	default         faceLimited Gauss linear 1.0;
}

divSchemes
{
    default         none;
    div(tauMC)      Gauss linear;
    // div(phi,U)      bounded Gauss linearUpwind gradf(U);
    div(phi,U)      Gauss linearUpwind grad(U);
    div(phi,omega)  Gauss linearUpwind grad(omega);
    div(phi,k)      Gauss linearUpwind grad(omega);
    div(phi,epsilon) bounded Gauss upwind;
    div(phi,k)      Gauss upwind Gauss linear; //bounded Gauss upwind;
    div(phi,R)      bounded Gauss upwind;
    div(R)          Gauss linear;
    div(phi,nuTilda) bounded Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
    reconstruct(rho) vanLeer;
    reconstruct(U)  vanLeerV;
    reconstruct(T)  vanLeer;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
